metaneutrons/rumiga/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# D1001 hardware baseline, independently reproduced from the audited Vellum
# bring-up revision recorded in toolchain/manifest.toml.
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# The table sits at 0x10000 so the bootloader has a 56 KiB window; the stock
# 0x8000 offset leaves 480 bytes and cannot hold a Secure Boot V2 signature.
#
# The product layout lives in `firmware/partitions.csv` and is applied when the
# flashable image is generated. `esp-idf-sys` documents that a custom table in
# `sdkconfig.defaults` is ignored by its generated CMake project, so the table
# the ESP-IDF build emits is a build artifact and not the shipped layout.
CONFIG_PARTITION_TABLE_OFFSET=0x10000
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
